In [ ]:
#pandas methoda
df.head()
df.tail()
df.merge(df,df1)
df.value_counts()
df.value_counts().sum()
df.describe()
df.info()
df.sort_values(by=['Age'],ascending=True)
df.groupby("Department")["Salary"].min()
df.groupby("Department")["Salary"].max()
df.groupby("Department")["Salary"].sum()
df.groupby("Salary")["Name"].max().sort_index(ascending=False)
concat = [df,df1]
pd.concat(concat)

In [ ]:
# # How do make the column names in lowercase of the DataFrame?
# # Select only the 'Name' and 'Salary' from Dataframe?
# # How do you calculate the average salary of all employees?
# # Show the data by 'Department' and calculate the total salary, average, max and min for each department?
# # find the employee with the highest salary?
# # Who is Working longest in the company and what department does he belong to

# data = {
#     'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
#     'Age': [25, 30, 35, 40, 25, 30],
#     'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'New York', 'Chicago'],
#     'Salary': [70000, 80000, 90000, 100000, 75000, 85000],
#     'Department': ['HR', 'Finance', 'IT', 'IT', 'Finance', 'HR']
# }

# data2 = {
#     'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
#     'Joining_Year': [2018, 2019, 2020, 2021, 2018, 2022]
# }
# how you can find even numbers from a list using the filter() function in Python:

# ✅ Example:
# python
# Copy
# Edit
# numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# # Use filter to get even numbers
# even_numbers = list(filter(lambda x: x % 2 == 0, numbers))

# print(even_numbers)

In [7]:
import pandas as pd

In [ ]:
row = ["crikcet","football","tennis"]
column = ["rohit","ronaldo","jcovich"]

df = pd.DataFrame({"name":column,
                    "sport":row
})
print(df)

      name     sport
0    rohit   crikcet
1  ronaldo  football
2  jcovich    tennis

In [19]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Age': [25, 30, 35, 40, 25, 30],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'New York', 'Chicago'],
    'Salary': [70000, 80000, 90000, 100000, 75000, 85000],
    'Department': ['HR', 'Finance', 'IT', 'IT', 'Finance', 'HR']
}

data2 = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Joining_Year': [2018, 2019, 2020, 2021, 2018, 2022]
}

In [8]:
data3 = pd.DataFrame(data)["Name"].str.lower()
data3

0      alice
1        bob
2    charlie
3      david
4        eva
5      frank
Name: Name, dtype: object

In [22]:
df = pd.DataFrame(data)

In [26]:
df = pd.DataFrame(data)    #extract the salary and age column first convert the data into pandas dataframe
df[["Name","Salary"]]

      Name  Salary
0    Alice   70000
1      Bob   80000
2  Charlie   90000
3    David  100000
4      Eva   75000
5    Frank   85000

In [30]:
df.describe()

             Age         Salary
count   6.000000       6.000000
mean   30.833333   83333.333333
std     5.845226   10801.234497
min    25.000000   70000.000000
25%    26.250000   76250.000000
50%    30.000000   82500.000000
75%    33.750000   88750.000000
max    40.000000  100000.000000

In [1]:
# # Show the data by 'Department' and calculate the total salary, average, max and min for each department?

# df[["Salary","Department"]]
# df_summary = df.groupby('Department')['Salary'].agg(
#     Total_Salary='sum',
#     Average_Salary='mean',
#     Max_Salary='max',
#     Min_Salary='min'
# )

# print(df_summary)

In [53]:
df.groupby("Department")["Salary"].sum()

Department
Finance    155000
HR         155000
IT         190000
Name: Salary, dtype: int64

In [54]:
df.groupby("Department")["Salary"].min()

Department
Finance    75000
HR         70000
IT         90000
Name: Salary, dtype: int64

In [55]:
df.groupby("Department")["Salary"].max()

Department
Finance     80000
HR          85000
IT         100000
Name: Salary, dtype: int64

In [68]:
# # find the employee with the highest salary?
df.groupby("Salary")["Name"].max().sort_index(ascending=False)

Salary
100000      David
90000     Charlie
85000       Frank
80000         Bob
75000         Eva
70000       Alice
Name: Name, dtype: object

In [37]:
# # Who is Working longest in the company and what department does he belong to

data2 = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Joining_Year': [2018, 2019, 2020, 2021, 2018, 2022]
}

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank'],
    'Age': [25, 30, 35, 40, 25, 30],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'New York', 'Chicago'],
    'Salary': [70000, 80000, 90000, 100000, 75000, 85000],
    'Department': ['HR', 'Finance', 'IT', 'IT', 'Finance', 'HR']
}

fd = pd.DataFrame(data)
cd = pd.DataFrame(data2)
# concat = [fd,cd]
# pd.concat(concat)     #not work for this case
vd = pd.merge(fd,cd)
vd.sort_values(by=['Joining_Year'],ascending=True)

      Name  Age         City  Salary Department  Joining_Year
0    Alice   25     New York   70000         HR          2018
4      Eva   25     New York   75000    Finance          2018
1      Bob   30  Los Angeles   80000    Finance          2019
2  Charlie   35      Chicago   90000         IT          2020
3    David   40      Houston  100000         IT          2021
5    Frank   30      Chicago   85000         HR          2022

In [28]:
import pandas as pd

data = [['John', 50, 'Male', 'Austin', 70],
['Cataline', 45 ,'Female', 'San Francisco', 80],
['Matt', 30 ,'Male', 'Boston', 95],
['Oliver',35,'Male', 'New york', 65]]

# Column labels of the DataFrame
columns = ['Name','Age','Sex', 'City', 'Marks']

# Create a DataFrame df
df = pd.DataFrame(data, columns=columns)

# Sort values based on ‘Age’ column
df.sort_values(by=['Age'],ascending=True)

       Name  Age     Sex           City  Marks
2      Matt   30    Male         Boston     95
3    Oliver   35    Male       New york     65
1  Cataline   45  Female  San Francisco     80
0      John   50    Male         Austin     70

In [38]:
tushar = ({"salary":[1500,1000,3000,5555],
          "name":["ritik","ritik","kartik","jack"]
})

df = pd.DataFrame(tushar)
# df.value_counts()
# df.sort_values(by=["salary"])
# df[df.duplicated()]
df["name"].duplicated().value_counts()

name
False    3
True     1
Name: count, dtype: int64

In [ ]:


rev

'rahsut'

In [26]:
num = 153
df = str(num)
fd = list(df)

check = 0
for i in fd:
    df = int(i) * int(i) * int(i)
    check +=df
check

153

In [27]:
def check_armstrong(n):
    df = list(str(n))

    check = 0
    for i in df:
        ds = int(i) * int(i) * int(i)
        check += ds

    if check == n:
        return True
    else:
        return False
check_armstrong(153)

True